# 3. 판다스(Pandas)

In [1]:
import numpy as np
import pandas as pd

In [7]:
s = pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])
print(s)

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
s = pd.Series([1, 2, 3], index=['a', 'b', 'c'])

In [10]:
s

a    1
b    2
c    3
dtype: int64

In [11]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [18]:
print(s['b'])
print(s.loc['b'])
print(s.iloc[1])

2
2
2

In [19]:
s['a'] = 0

In [20]:
s

a    0
b    2
c    3
dtype: int64

In [21]:
s.iloc[2] = 99

In [22]:
s

a     0
b     2
c    99
dtype: int64

In [25]:
data = {'city': ['서울', '인천'],
       'pop' : [990, 240]}
df = pd.DataFrame(data)
df

  city  pop
0   서울  990
1   인천  240

In [42]:
data = np.array([[60, 70, 80], [70, 80, 90], [80, 90, 100]])
df = pd.DataFrame(data,
                 index=['둘리', '또치', '도우너'],
                 columns=['국어', '영어', '수학'])
df

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

In [ ]:
df.loc[ : , : ]

In [27]:
df['영어']

둘리     70
또치     80
도우너    90
Name: 영어, dtype: int64

In [28]:
df['과학'] = [60, 70, 80]

In [29]:
df

     국어  영어   수학  과학
둘리   60  70   80  60
또치   70  80   90  70
도우너  80  90  100  80

In [30]:
df.insert(1, '미술', [70, 80, 90])

In [31]:
df

     국어  미술  영어   수학  과학
둘리   60  70  70   80  60
또치   70  80  80   90  70
도우너  80  90  90  100  80

In [33]:
del df['과학']

In [34]:
df

     국어  미술  영어   수학
둘리   60  70  70   80
또치   70  80  80   90
도우너  80  90  90  100

In [43]:
df = df.drop('수학', axis=1)

In [44]:
df.drop('또치', axis=0)

     국어  영어
둘리   60  70
도우너  80  90

In [48]:
lis = [-2, -1, 0, 1, 2]
for n in lis:
    print(n+1)

-1
0
1
2
3

In [49]:
s = pd.Series([-2, -1, 0, 1, 2])
s + 1
s.add(1)

0   -1
1    0
2    1
3    2
4    3
dtype: int64

In [62]:
s[s > 0]

3    1
4    2
dtype: int64

In [75]:
s = pd.Series(np.arange(1, 11))
s[s % 2 == 0]

1     2
3     4
5     6
7     8
9    10
dtype: int64

In [76]:
data = np.array([[60, 70, 80], [70, 80, 90], [80, 90, 10]])
df = pd.DataFrame(data,
                  index=['둘리', '또치', '도우너'],
                  columns=['국어', '영어', '수학'])
df

     국어  영어  수학
둘리   60  70  80
또치   70  80  90
도우너  80  90  10

In [79]:
df['국어'].dtype

dtype('int64')

In [78]:
type(df['국어'])

pandas.core.series.Series

In [81]:
df + 1
df['국어'] + 1

둘리     61
또치     71
도우너    81
Name: 국어, dtype: int64

In [84]:
# 국어 점수를 기준으로 정렬
df.sort_values('국어')

     국어  영어  수학
둘리   60  70  80
또치   70  80  90
도우너  80  90  10

In [85]:
# 국어 점수를 역순으로 정렬
df.sort_values('국어', ascending=False)

     국어  영어  수학
도우너  80  90  10
또치   70  80  90
둘리   60  70  80

In [101]:
data = np.random.randint(60, 100, 9)
arr = data.reshape(3, 3)
arr
df = pd.DataFrame(arr,
                 index=['둘리', '또치', '도우너'],
                 columns=['수학', '영어', '과학'])
df

     수학  영어  과학
둘리   67  64  71
또치   84  63  82
도우너  66  68  63

In [102]:
df.sort_values('수학')

     수학  영어  과학
도우너  66  68  63
둘리   67  64  71
또치   84  63  82

In [103]:
df.loc['둘리', '영어'] = np.nan
df

     수학    영어  과학
둘리   67   NaN  71
또치   84  63.0  82
도우너  66  68.0  63

In [104]:
df = df.dropna(axis=0)
df

     수학    영어  과학
또치   84  63.0  82
도우너  66  68.0  63

In [105]:
df.loc['또치', '과학'] = np.nan
df

     수학    영어    과학
또치   84  63.0   NaN
도우너  66  68.0  63.0

In [106]:
df.fillna(0)

     수학    영어    과학
또치   84  63.0   0.0
도우너  66  68.0  63.0

In [4]:
s = pd.Series(['사과', '배', '사과', '배', '바나나'])
s

0     사과
1      배
2     사과
3      배
4    바나나
dtype: object

In [5]:
s.unique()

array(['사과', '배', '바나나'], dtype=object)

In [6]:
s.value_counts()

사과     2
배      2
바나나    1
Name: count, dtype: int64

In [7]:
address = pd.Series(['서울', '부산', '서울', '대구', '부산', '광주', '서울'])

In [8]:
address.unique()

array(['서울', '부산', '대구', '광주'], dtype=object)

In [9]:
address.value_counts()

서울    3
부산    2
대구    1
광주    1
Name: count, dtype: int64

In [10]:
name = pd.Series(['민수', '철수', '지연', '민수', '영희', '민수', '지연'])

In [16]:
name.value_counts()

민수    3
지연    2
철수    1
영희    1
Name: count, dtype: int64